app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {

        $request->validate([
            'email' => 'required|email',
            'password' => 'required'
        ]);
        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'ermhroy@gmail.com' limit 1