app/Http/Controllers/Auth/admin/LoginController.php

    public function login(){

       $data = request()->validate([
            'email' => 'required',
            'password' => 'required',
        ]);

        $admin = Admin_users::where('email', request('email'))->first();
---
select * from `admin_users` where `email` = 'ermhroy7@gmail.com' limit 1