app/Listeners/CacheListener.php

    public function handle($event)
    {

        cache()->forget('posts');
        $posts = Post::with('admin', 'user', 'favorite_to_users', 'comments')->latest()->get();
---
select * from `comments` where `comments`.`post_id` in (1, 2, 3, 4, 5, 6)
select * from `posts` order by `created_at` desc
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 2, 3, 4, 5, 6)