app/Http/Controllers/AllPostController.php

select * from `comments` where `comments`.`post_id` in (1, 2, 3, 4)
select `user_id`, `admin_id`, `id`, `slug`, `title`, `view_count`, `image` from `posts` where `status` = 1 and `is_approved` = 1 order by `created_at` desc limit 12 offset 0
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 2, 3, 4)
select count(*) as aggregate from `posts` where `status` = 1 and `is_approved` = 1
---
   public function index(){


        $posts = Post::with(['user', 'admin', 'favorite_to_users', 'comments'])
        ->select('user_id', 'admin_id', 'id', 'slug', 'title', 'view_count', 'image')
        ->where('status', 1)
        ->where('is_approved', 1)
        ->latest()->paginate(12);