app/Http/Controllers/CategoryPostController.php

select * from `categories` where `slug` = 'laravel' limit 1
select * from `comments` where `comments`.`post_id` in (1, 3)
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 3)
---
    public function index($categorySlug)
    {
        $category = Category::where('slug', $categorySlug)->firstOrFail();
         $posts = $category->posts()
        ->with(['admin', 'user', 'favorite_to_users', 'comments'])
        //->select(['id','title', 'slug', 'image', 'view_count', 'user_id', 'admin_id'])
        ->where('status', 1)->where('is_approved', 1)
        ->get();