app/Http/Controllers/CommentController.php

    public function index()
    {
        $posts = Post::with(['user','comments'])->select(['id'])->where('user_id', Auth::user()->id)->get();
---
select `id` from `posts` where `user_id` = 8

    public function addComment(Request $request)
    {
        $validator = Validator::make($request->all(),[
            'comment' => 'required',
            'postId' => 'required'
        ]);

        if ($validator->passes()) {
            Comment::create([
                'user_id' => Auth::user()->id,
                'post_id'    => $request->postId,
                'comment' => $request->comment
            ]);
            // Toastr::success('Comment added successfully', 'success', ['positionClass' => 'toast-top-right']);
            // return back();
            $allComments = Comment::with('user')->where('post_id',$request->postId)->get();
            $countComments = Comment::where('post_id', $request->postId)->count();
---
select * from `comments` where `post_id` = '6'
select * from `users` where `users`.`id` in (8)
select count(*) as aggregate from `comments` where `post_id` = '6'