app/Http/Controllers/FavoritePostController.php

insert into `post_user` (`created_at`, `post_id`, `updated_at`, `user_id`) values ('2019-08-08 20:57:22', '7', '2019-08-08 20:57:22', 8)
delete from `post_user` where `user_id` = 8 and `post_id` in ('7')
---
    public function add($postId)
    {
        $user = Auth::user();

        $countFavoriteList = $user->favorite_posts()
        ->where('post_id', $postId)->count();

        if ($countFavoriteList === 0) {
            $user->favorite_posts()->attach($postId);
            Toastr::success('Successfully you have added this post to favorite list', 'success', ['positionClass' => 'toast-top-right']);
            return back();
        }elseif($countFavoriteList === 1){
            $user->favorite_posts()->detach($postId);