app/Http/Controllers/HomeController.php

     public function index()
     {

      $data['categories'] = Category::latest()->get();

      $data['posts'] = Post::with('user', 'admin', 'favorite_to_users', 'comments')
               ->select(['id', 'slug', 'user_id', 'admin_id', 'title', 'view_count', 'image'])
               ->where('is_approved', 1)
               ->where('status', 1)
               ->latest()->take(12)->get();
---
select * from `categories` order by `created_at` desc
select * from `comments` where `comments`.`post_id` in (1, 2, 3, 4, 5, 6, 7)
select `id`, `slug`, `user_id`, `admin_id`, `title`, `view_count`, `image` from `posts` where `is_approved` = 1 and `status` = 1 order by `created_at` desc limit 12
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 2, 3, 4, 5, 6, 7)