app/Http/Controllers/SinglePostController.php

    public function index($postSlug)
    {

        $post = Post::with(['user', 'admin', 'favorite_to_users', 'categories', 'tags', 'comments'])
        ->where('slug', $postSlug)
        ->firstOrFail();

        $randomPosts = Post::with(['user','admin','favorite_to_users', 'comments'])
        ->select('id', 'title', 'image', 'slug', 'admin_id', 'user_id', 'view_count')
        ->where('status', 1)
        ->where('is_approved', 1)
        ->take(3)
        ->inRandomOrder()
        ->get();
       $commentsCount = Comment::where('post_id', $post->id)->count();
        $storeSessionKey = "blog_". $post->id;
        if (!Session::has($storeSessionKey)) {
            $post->increment('view_count');
---
select * from `comments` where `comments`.`post_id` in (2)
select * from `posts` where `slug` = 'why-we-should-learn-nodejs-in-2019' limit 1
select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id`, `category_post`.`created_at` as `pivot_created_at`, `category_post`.`updated_at` as `pivot_updated_at` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (2)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id`, `post_tag`.`created_at` as `pivot_created_at`, `post_tag`.`updated_at` as `pivot_updated_at` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (2)
select * from `comments` where `comments`.`post_id` in (1, 4, 5)
select `id`, `title`, `image`, `slug`, `admin_id`, `user_id`, `view_count` from `posts` where `status` = 1 and `is_approved` = 1 order by RAND() limit 3
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 4, 5)
select count(*) as aggregate from `comments` where `post_id` = 2
update `posts` set `view_count` = `view_count` + 1, `posts`.`updated_at` = '2019-08-08 20:56:04' where `id` = 2

    public function commentShow($post_id)
    {
        $showComment = Comment::with('user')->where('post_id', $post_id)->get();
---
select * from `comments` where `post_id` = '6'
select * from `users` where `users`.`id` in (8)