app/Http/Controllers/TagPostController.php

    public function index($tagSlug)
    {
        $tag = Tag::where('slug', $tagSlug)->firstOrFail();
        $posts = $tag->posts()
        ->with('user', 'admin', 'favorite_to_users', 'comments')
        ->where('status', 1)
        ->where('is_approved', 1)
        ->get();
---
select * from `tags` where `slug` = 'vue-js' limit 1
select * from `comments` where `comments`.`post_id` in (2, 3, 4, 5, 6)
select `posts`.*, `post_tag`.`tag_id` as `pivot_tag_id`, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`created_at` as `pivot_created_at`, `post_tag`.`updated_at` as `pivot_updated_at` from `posts` inner join `post_tag` on `posts`.`id` = `post_tag`.`post_id` where `post_tag`.`tag_id` = 2 and `status` = 1 and `is_approved` = 1
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (2, 3, 4, 5, 6)