app/Http/Controllers/UserDashboardController.php

select `posts`.*, (select count(*) from `comments` where `posts`.`id` = `comments`.`post_id`) as `comments_count`, (select count(*) from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `posts`.`id` = `post_user`.`post_id`) as `favorite_to_users_count` from `posts` where `posts`.`user_id` = 8 and `posts`.`user_id` is not null order by `view_count` desc, `comments_count` desc, `favorite_to_users_count` desc limit 10
select count(*) as aggregate from `posts` where `user_id` = 8 and `is_approved` = 1
select count(*) as aggregate from `posts` where `user_id` = 8 and `is_approved` = 0
---
    public function index()
    {

       $user = Auth::user('web');
       $popularPosts = $user->posts()
       ->withCount('comments')
       ->withCount('favorite_to_users')
       ->orderBy('view_count', 'desc')
       ->orderBy('comments_count', 'desc')
       ->orderBy('favorite_to_users_count', 'desc')
       ->take(10)
       ->get();

        $postCount = Post::where('user_id', Auth::user('web')->id)->where('is_approved', 1)->count();
        $pendingPost = Post::where('user_id', Auth::user('web')->id)->where('is_approved', 0)->count();