app/Http/Controllers/UserProfileController.php

select count(*) as aggregate from `posts` where `user_id` = 8 and `status` = 1
---
    public function index()
    {
        $postCount = Post::where('user_id', Auth::user('web')->id)->where('status', 1)->count();

select * from `users` where `id` = 8 limit 1
update `users` set `image` = '5d4c33ce7b4a2.jpeg', `users`.`updated_at` = '2019-08-08 20:38:06' where `id` = 8
---
    public function update(Request $request)
    {
      $this->validate($request, [
            'username' => 'required',
            'image'=> 'sometimes|image'
      ]);
      $updateAdminInfo = User::where('id', Auth::user('web')->id)->first();
      $profileImage = $request->file('image');
      if ($request->hasFile('image')) {
          $profileImageName = uniqid().'.'.$profileImage->getClientOriginalExtension();
          $resizeImage = Image::make($profileImage)->resize(400,400)->save($profileImageName);
            if(!Storage::disk('public')->exists('user')){
                Storage::disk('public')->makeDirectory('user');
            }

            Storage::disk('public')->put('user/'.$profileImageName,$resizeImage);

            if($updateAdminInfo->image !== 'default.jpg'){
                if (Storage::disk('public')->exists('user/'.$updateAdminInfo->image)) {
                    Storage::disk('public')->delete('user/'.$updateAdminInfo->image);