app/Http/Controllers/UserPostController.php

    public function index()
    {
        // $data['posts'] = cache('posts', function(){

        //    return Post::with('user')->where('user_id', Auth::user('web')->id)
        //    ->where('admin_id', null)
        //    ->select(['id', 'title', 'view_count', 'created_at', 'status', 'is_approved', 'user_id', 'image'])
        //    ->get();

        // });

        $data['posts'] = Post::with('user')->where('user_id', Auth::user('web')->id)
           ->where('admin_id', null)
           ->select(['id', 'title', 'view_count', 'created_at', 'status', 'is_approved', 'user_id', 'image'])
           ->get();
---
select * from `users` where `users`.`id` in (8)
select `id`, `title`, `view_count`, `created_at`, `status`, `is_approved`, `user_id`, `image` from `posts` where `user_id` = 8 and `admin_id` is null

    public function create()
    {
        $categories = Category::latest()->get();
        $tags = Tag::latest()->get();
---
select * from `categories` order by `created_at` desc
select * from `tags` order by `created_at` desc

           $createPost->description = $request->description;
           $createPost->is_approved = 0;
           $createPost->user_id = Auth::user('web')->id;
           $createPost->save();

           $createPost->categories()->attach($request->category_id);
           $createPost->tags()->attach($request->tag_id);
        }
        $adminUsers = Admin_users::where('role', 1)->get();
---
insert into `posts` (`title`, `slug`, `image`, `status`, `description`, `is_approved`, `user_id`, `updated_at`, `created_at`) values ('Why everyone are using youtube?', 'why-everyone-are-using-youtube', '5d4c35cfdbcf7.jpg', '1', '<p>You can get almost everything on youtube. That\'s why everyone uses youtube.</p>', 0, 8, '2019-08-08 20:46:40', '2019-08-08 20:46:40')
insert into `post_tag` (`created_at`, `post_id`, `tag_id`, `updated_at`) values ('2019-08-08 20:46:40', 7, '6', '2019-08-08 20:46:40'), ('2019-08-08 20:46:40', 7, '5', '2019-08-08 20:46:40'), ('2019-08-08 20:46:40', 7, '4', '2019-08-08 20:46:40'), ('2019-08-08 20:46:40', 7, '2', '2019-08-08 20:46:40')
select * from `admin_users` where `role` = 1

    public function show($id)
    {
        $post = Post::where('id', $id)->firstOrFail();
---
select * from `posts` where `id` = '6' limit 1

    public function edit($id)
    {

        $post = Post::where('id', $id)->firstOrFail();
        $categories = Category::latest()->get();
        $tags = Tag::latest()->get();
---
select * from `posts` where `id` = '7' limit 1
select * from `categories` order by `created_at` desc
select * from `tags` order by `created_at` desc