app/Http/Controllers/admin/AdminProfileInfoController.php

select * from `admin_users` where `id` = 1 limit 1
---
    public function update(Request $request)
    {
      $this->validate($request, [
            'username' => 'required',
            'image'=> 'sometimes|image'
      ]);
      $updateAdminInfo = Admin_users::where('id', Auth::user('admin')->id)->first();