app/Http/Controllers/admin/ApprovalController.php

    public function index()
    {
        $notApprovalPosts = Post::where('is_approved', false)->latest()->get();
---
select * from `posts` where `is_approved` = 0 order by `created_at` desc

    public function approvalAction($notApprovalId)
    {
        $approvePost = Post::where('id', $notApprovalId)->first();
        $approvePost->update([
            'is_approved' => true
        ]);
---
select * from `posts` where `id` = '7' limit 1
update `posts` set `is_approved` = 1, `posts`.`updated_at` = '2019-08-08 20:49:31' where `id` = 7

    public function postCheck($notApprovalId){

        $notApprovalPost = Post::where('id', $notApprovalId)->firstOrFail();
---
select * from `posts` where `id` = '6' limit 1