app/Http/Controllers/admin/CategoryController.php

    public function index()
    {
        $categories = Category::latest()->get();
---
select * from `categories` order by `created_at` desc

    public function destroy($id)
    {
        $deleteCategory = Category::find($id);
        if (Storage::disk('public')->exists('category/'.$deleteCategory->image)) {
            Storage::disk('public')->delete('category/'. $deleteCategory->image);
        }
        if (Storage::disk('public')->exists('category/slider/'.$deleteCategory->image)){
            Storage::disk('public')->delete('category/slider/'.$deleteCategory->image);
        }
        $deleteCategory->delete();
---
delete from `categories` where `id` = 9