app/Http/Controllers/admin/DashboardController.php

    public function index()
    {
        $countPendingPost = Post::where('is_approved', 0)->count();
        $totalUsers = User::where('status', 1)->count();
        $countTodayUser = User::where('status', 1)->where('created_at', Carbon::today())->count();
        $countPost = Post::where('status', 1)->where('is_approved', 1)->count();
        $totalComments = Comment::count();
        $countCategories = Category::count();
        $countTags = Tag::count();
        $ActiveUsersList = User::where('status', 1)
                    ->withCount('comments')
                    ->withCount('posts')
                    ->withCount('favorite_posts')
                    ->orderBy('comments_count', 'desc')
                    ->orderBy('posts_count', 'desc')
                    ->orderBy('favorite_posts_count', 'desc')
                    ->take(10)
                    ->get();

        $topPosts = Post::with(['user', 'admin', 'comments', 'favorite_to_users'])->where('is_approved', 1)
                    ->withCount('comments')
                    ->withCount('favorite_to_users')
                    ->orderBy('comments_count', 'desc')
                    ->orderBy('favorite_to_users_count', 'desc')
                    ->orderBy('view_count', 'desc')
                    ->take(5)
                    ->get();
---
select count(*) as aggregate from `posts` where `is_approved` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 1 and `created_at` = '2019-08-08 00:00:00'
select count(*) as aggregate from `posts` where `status` = 1 and `is_approved` = 1
select `users`.*, (select count(*) from `comments` where `users`.`id` = `comments`.`user_id`) as `comments_count`, (select count(*) from `posts` where `users`.`id` = `posts`.`user_id`) as `posts_count`, (select count(*) from `posts` inner join `post_user` on `posts`.`id` = `post_user`.`post_id` where `users`.`id` = `post_user`.`user_id`) as `favorite_posts_count` from `users` where `status` = 1 order by `comments_count` desc, `posts_count` desc, `favorite_posts_count` desc limit 10
select `posts`.*, (select count(*) from `comments` where `posts`.`id` = `comments`.`post_id`) as `comments_count`, (select count(*) from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `posts`.`id` = `post_user`.`post_id`) as `favorite_to_users_count` from `posts` where `is_approved` = 1 order by `comments_count` desc, `favorite_to_users_count` desc, `view_count` desc limit 5
select `users`.*, `post_user`.`post_id` as `pivot_post_id`, `post_user`.`user_id` as `pivot_user_id`, `post_user`.`created_at` as `pivot_created_at`, `post_user`.`updated_at` as `pivot_updated_at` from `users` inner join `post_user` on `users`.`id` = `post_user`.`user_id` where `post_user`.`post_id` in (1, 2, 4, 6, 7)