app/Http/Controllers/admin/PostController.php

    public function create()
    {
        $categories = Category::latest()->get();
        $tags = Tag::latest()->get();
---
select * from `categories` order by `created_at` desc
select * from `tags` order by `created_at` desc

           $createPost->description = $request->description;
           $createPost->is_approved = 1;
           $createPost->admin_id = Auth::user('admin')->id;
           $createPost->save();

           $createPost->categories()->attach($request->category_id);
           $createPost->tags()->attach($request->tag_id);
---
insert into `posts` (`title`, `slug`, `image`, `status`, `description`, `is_approved`, `admin_id`, `updated_at`, `created_at`) values ('Why vue.js now becoming a popular javaScript library?', 'why-vuejs-now-becoming-a-popular-javascript-library', '5d4c3022b8af5.png', '1', '<p>Vue.js is easiest, faster frontend web library. So very begainer choose it first.</p>', 1, 1, '2019-08-08 20:22:27', '2019-08-08 20:22:27')
insert into `post_tag` (`created_at`, `post_id`, `tag_id`, `updated_at`) values ('2019-08-08 20:11:50', 2, '6', '2019-08-08 20:11:50'), ('2019-08-08 20:11:50', 2, '5', '2019-08-08 20:11:50'), ('2019-08-08 20:11:50', 2, '4', '2019-08-08 20:11:50'), ('2019-08-08 20:11:50', 2, '2', '2019-08-08 20:11:50')

    public function show($id)
    {


        $data['post'] = Post::where('id', $id)->firstOrFail();
---
select * from `posts` where `id` = '1' limit 1