app/Http/Controllers/admin/TagsController.php

    public function index()
    {
        $tags = Tag::all();
---
select * from `tags`

    public function destroy($id)
    {
        Tag::find($id)->delete();
---
delete from `tags` where `id` = 7